In [108]:
#Dependencies
import pandas as pd

In [109]:
#Assign variable to read csv file
school_path="../Resources/schools_complete.csv"
student_path="../Resources/students_complete.csv"
print(school_path)

../Resources/schools_complete.csv

In [110]:
#Create Panda dataframes by reading csv file
school_df=pd.read_csv(school_path)
student_df=pd.read_csv(student_path)

In [111]:
#Merge 2 tables provided;student info table, school table; complete_df
complete_df=pd.merge(student_df, school_df, how="left", on=["school_name","school_name"])
complete_df

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
...,...,...,...,...,...,...,...,...,...,...,...
39165,39165,Donna Howard,F,12th,Thomas High School,99,90,14,Charter,1635,1043130
39166,39166,Dawn Bell,F,10th,Thomas High School,95,70,14,Charter,1635,1043130
39167,39167,Rebecca Tanner,F,9th,Thomas High School,73,84,14,Charter,1635,1043130
39168,39168,Desiree Kidd,F,10th,Thomas High School,99,90,14,Charter,1635,1043130
39169,39169,Carolyn Jackson,F,11th,Thomas High School,95,75,14,Charter,1635,1043130

In [112]:
#SUMMARY - summary_p1_mean_df
##Columns required: school_name, average math score, average reading score 

#groupby per school and find mean 
summary_p1_df=complete_df.groupby(["school_name"])

summary_p1_mean_df=summary_p1_df.mean()

#Rename coluuns
summary_p1_mean_df=summary_p1_mean_df.rename(columns={"reading_score":"Average Reading Score","math_score":"Average Math Score"})

#reset index to ensure school_name is a column
summary_p1_mean_df.reset_index(inplace=True)
summary_p1_mean_df

,school_name,Student ID,Average Reading Score,Average Math Score,School ID,size,budget
0,Bailey High School,20358.5,81.033963,77.048432,7.0,4976.0,3124928.0
1,Cabrera High School,16941.5,83.975780,83.061895,6.0,1858.0,1081356.0
2,Figueroa High School,4391.0,81.158020,76.711767,1.0,2949.0,1884411.0
3,Ford High School,36165.0,80.746258,77.102592,13.0,2739.0,1763916.0
4,Griffin High School,12995.5,83.816757,83.351499,4.0,1468.0,917500.0
5,Hernandez High School,9944.0,80.934412,77.289752,3.0,4635.0,3022020.0
6,Holden High School,23060.0,83.814988,83.803279,8.0,427.0,248087.0
7,Huang High School,1458.0,81.182722,76.629414,0.0,2917.0,1910635.0
8,Johnson High School,32415.0,80.966394,77.072464,12.0,4761.0,3094650.0
9,Pena High School,23754.5,84.044699,83.839917,9.0,962.0,585858.0
10,Rodriguez High School,28035.0,80.744686,76.842711,11.0,3999.0,2547363.0
11,Shelton High School,6746.0,83.725724,83.359455,2.0,1761.0,1056600.0
12,Thomas High School,38352.0,83.848930,83.418349,14.0,1635.0,1043130.0
13,Wilson High School,14871.0,83.989488,83.274201,5.0,2283.0,1319574.0
14,Wright High School,25135.5,83.955000,83.682222,10.0,1800.0,1049400.0

In [113]:
#Reading the 2 csv files for information

# Print column headings of dataframes
print(school_df.columns)
print("")

print(student_df.columns)
print("")

#Print first 5 rows of the school and student dataframes
print(f"school_df\n{school_df.head()}\n\n--------------------------------------------------------------\n")

print(f"student_df\n{student_df.head()}\n")

#Print total number of schools, total number of students
print(f"Total items in school_df:{len(school_df)}")
print(f"Total items in student_df:{len(student_df)}")

Index(['School ID', 'school_name', 'type', 'size', 'budget'], dtype='object')

Index(['Student ID', 'student_name', 'gender', 'grade', 'school_name',
       'reading_score', 'math_score'],
      dtype='object')

school_df
   School ID            school_name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

--------------------------------------------------------------

student_df
   Student ID       student_name gender grade        school_name  \
0           0       Paul Bradley      M   9th  Huang High School
1           1       Victor Smith      M  12th  Huang High School
2           2    Kevin Rodriguez      M  12th  Huang High School
3           3  Dr. Richard Scott      M  12th  Huang High School
4           4         Bonnie Ray      F   9th  Huang High School

   reading_score  math_score
0             66          79
1             94          61
2             90          60
3             67          58
4             97          84

Total items in school_df:15
Total items in student_df:39170

In [114]:
#OUTPUTS FOR DISTRICT SUMMARY: Total Schools, Total Students, Total Budget, Average Math Schore, Average Reading Score
print("DISTRICT SUMMARY\n----------------")

#Total Number of Schools (via count) 
total_schools=school_df["school_name"].count()
print(f"Total Schools: {total_schools}")

#Total Number of Students (via sum)
total_students=school_df["size"].sum()
print(f"Total Students: {total_students}")

#Total Budget (via sum)
total_budget=school_df["budget"].sum()
print(f"Total Budget: ${total_budget:,}")

#Average Maths Score
##TEST: avg_math_score=student_df["math_score"].sum()/total_students
avg_math_score=student_df["math_score"].mean()
print(f"Average Math Score: {avg_math_score:.1f}")

#Average Reading Score
##TEST: avg_reading_score=student_df["reading_score"].sum()/total_students
avg_reading_score=student_df["reading_score"].mean()
print(f"Average Reading Score: {avg_reading_score:.1f}")

DISTRICT SUMMARY
----------------
Total Schools: 15
Total Students: 39170
Total Budget: $24,649,428
Average Math Score: 79.0
Average Reading Score: 81.9

In [115]:
#OUTPUTS FOR DISTRICT SUMMARY: Percent Students Passing Math, Percent Students Passing Reading, Percent Students Passing Both

#Percentage Passing Math (The percentage of students that passed Math)
students_pass_math=student_df[student_df["math_score"]>=70].count()["student_name"]
#print(students_pass_math)

# TEST to get an idea of min, max, median and avg score: 
#print(student_df.describe())

percent_pass_math=students_pass_math/total_students*100
print(f"Percentage Students Passing Maths: {percent_pass_math:.2f}%")

#Percentage passing Reading (The percentage of students that passed Reading)
students_pass_reading=student_df[student_df["reading_score"]>=70].count()["student_name"]
percent_pass_reading=students_pass_reading/total_students*100
print(f"Percentage Students Passing Reading: {percent_pass_reading:.2f}%")

#Number of students that passed Math and Reading
students_pass_both=(student_df[(student_df["math_score"]>=70) & (student_df["reading_score"]>=70)]).count()["student_name"]

#Percent of students that passed Math and Reading
percent_pass_both=students_pass_both/total_students*100
print(f"Percentage Students Passing Both: {percent_pass_both:.2f}%")

Percentage Students Passing Maths: 74.98%
Percentage Students Passing Reading: 85.81%
Percentage Students Passing Both: 65.17%

In [116]:
#DISTRICT SUMMARY TABLE

total_budget_print=total_budget
dis_summary_df=pd.DataFrame({"Total Schools":[total_schools],"Total Students": [total_students],"Total Budget":[total_budget],"Average Math Score":[avg_math_score],"Average Reading Score":[avg_reading_score],"% Passing Math":[percent_pass_math],"% Passing Reading":[percent_pass_reading],"%Overall Passing":[percent_pass_both]})
dis_summary_df
dis_summary_df["Total Budget"]=dis_summary_df["Total Budget"].map("${:,}".format)
dis_summary_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,%Overall Passing
0,15,39170,"$24,649,428",78.985371,81.87784,74.980853,85.805463,65.172326

In [117]:
#This section groupby the school_name. The columns are : 1) total students that passed math; math_groupby_df 2) total students that passed reading;reading_groupby_df
# With 2 columns: math_reading_groupby_df

######MATH PASS (BOOLEAN) GROUPBY SCHOOL NAME#####
#bool_df is the table with columns of math_score_pass

#make a copy of complete_df to ensure complete_df remains unchanged and use new df 'bool_math_df'
bool_math_df=complete_df.copy()

#filter for only rows where math score is more that 70% (pass mark)
bool_math_df["bool_math_pass"]=bool_math_df["math_score"]>=70

###TEST to print bool_math_df
print(f"bool_math_df \n {bool_math_df}")

#Retain a copy with all the column headings
bool_math1_df=bool_math_df.copy()

#delete columns
bool_math1_df=bool_math_df.drop(columns=["Student ID","gender","grade","School ID", "type","size","budget","reading_score","math_score","student_name"])
bool_math1_df

###TEST to ensure complete_df is unchanged: 
#print(f"complete_df \n {complete_df}")

bool_math_pass_df=bool_math1_df[bool_math1_df.bool_math_pass==True]
bool_math_pass_df
math_groupby_df=bool_math_pass_df.groupby(["school_name"]).count()

#number of students that passed math grouped by school
math_groupby_df

#reset index to ensure school_name is a column
math_groupby_df.reset_index(inplace=True)
print(f"math_groupby_df \n {math_groupby_df}")

bool_math_df
        Student ID       student_name gender grade         school_name  \
0               0       Paul Bradley      M   9th   Huang High School
1               1       Victor Smith      M  12th   Huang High School
2               2    Kevin Rodriguez      M  12th   Huang High School
3               3  Dr. Richard Scott      M  12th   Huang High School
4               4         Bonnie Ray      F   9th   Huang High School
...           ...                ...    ...   ...                 ...
39165       39165       Donna Howard      F  12th  Thomas High School
39166       39166          Dawn Bell      F  10th  Thomas High School
39167       39167     Rebecca Tanner      F   9th  Thomas High School
39168       39168       Desiree Kidd      F  10th  Thomas High School
39169       39169    Carolyn Jackson      F  11th  Thomas High School

       reading_score  math_score  School ID      type  size   budget  \
0                 66          79          0  District  2917  1910635
1                 94          61          0  District  2917  1910635
2                 90          60          0  District  2917  1910635
3                 67          58          0  District  2917  1910635
4                 97          84          0  District  2917  1910635
...              ...         ...        ...       ...   ...      ...
39165             99          90         14   Charter  1635  1043130
39166             95          70         14   Charter  1635  1043130
39167             73          84         14   Charter  1635  1043130
39168             99          90         14   Charter  1635  1043130
39169             95          75         14   Charter  1635  1043130

       bool_math_pass
0                True
1               False
2               False
3               False
4                True
...               ...
39165            True
39166            True
39167            True
39168            True
39169            True

[39170 rows x 12 columns]
math_groupby_df
               school_name  bool_math_pass
0      Bailey High School            3318
1     Cabrera High School            1749
2    Figueroa High School            1946
3        Ford High School            1871
4     Griffin High School            1371
5   Hernandez High School            3094
6      Holden High School             395
7       Huang High School            1916
8     Johnson High School            3145
9        Pena High School             910
10  Rodriguez High School            2654
11    Shelton High School            1653
12     Thomas High School            1525
13     Wilson High School            2143
14     Wright High School            1680

In [118]:
######READING PASS (BOOLEAN) GROUPBY SCHOOL NAME#####

#make a copy of complete_df to ensure complete_df remains unchanged and use new df 'bool_reading_df'
bool_reading_df=complete_df.copy()

#filter for only rows where reading score is more that 70% (pass mark)
bool_reading_df["bool_reading_pass"]=bool_reading_df["reading_score"]>=70
###TEST to print bool_reading_df
#print(bool_reading_df)

#Retain a copy with all the column headings
bool_reading1_df=bool_reading_df.copy()

#deletes columns
bool_reading1_df=bool_reading_df.drop(columns=["Student ID","gender","grade","School ID", "type","size","budget","reading_score","math_score","student_name"])
bool_reading1_df

#Filter for only trues (students who passed reading)
bool_reading_pass_df=bool_reading1_df[bool_reading1_df.bool_reading_pass==True]
bool_reading_pass_df

#group by school_name and count the trues
reading_groupby_df=bool_reading_pass_df.groupby(["school_name"]).count()

#number of students that passed reading grouped by school
reading_groupby_df

#reset index to ensure school_name is a column
reading_groupby_df.reset_index(inplace=True)
print(f"reading_groupby_df \n {reading_groupby_df}")

reading_groupby_df
               school_name  bool_reading_pass
0      Bailey High School               4077
1     Cabrera High School               1803
2    Figueroa High School               2381
3        Ford High School               2172
4     Griffin High School               1426
5   Hernandez High School               3748
6      Holden High School                411
7       Huang High School               2372
8     Johnson High School               3867
9        Pena High School                923
10  Rodriguez High School               3208
11    Shelton High School               1688
12     Thomas High School               1591
13     Wilson High School               2204
14     Wright High School               1739

In [119]:
##### BOTH SUBJECTS PASSING: MATH AND READING PASS (BOOLEAN) GROUPBY SCHOOL NAME#####
bool_both_df=complete_df.copy()
bool_both_df["bool_both_pass"]=(bool_both_df["math_score"]>=70) & (bool_both_df["reading_score"]>=70)

##TEST to print bool_both_df
#print(bool_both_df)
bool_both1_df=bool_both_df.copy()

#deletes columns
bool_both1_df=bool_both_df.drop(columns=["Student ID","gender","grade","School ID", "type","budget","reading_score","math_score","student_name","size"])
bool_both1_df

#Filter for only trues (students who passed both reading and math)
bool_both_pass_df=bool_both1_df[bool_both1_df.bool_both_pass==True]
bool_both_pass_df

#group by school_name and count the trues
both_groupby_df=bool_both_pass_df.groupby(["school_name"]).count()

#number of students that passed both reading and math grouped by school
both_groupby_df

#reset index to ensure school_name is a column
both_groupby_df.reset_index(inplace=True)
print(f"both_groupby_df \n {both_groupby_df}")

both_groupby_df
               school_name  bool_both_pass
0      Bailey High School            2719
1     Cabrera High School            1697
2    Figueroa High School            1569
3        Ford High School            1487
4     Griffin High School            1330
5   Hernandez High School            2481
6      Holden High School             381
7       Huang High School            1561
8     Johnson High School            2549
9        Pena High School             871
10  Rodriguez High School            2119
11    Shelton High School            1583
12     Thomas High School            1487
13     Wilson High School            2068
14     Wright High School            1626

In [120]:
#################################################################################
#Merge dfs together for bool_math_pass and bool_reading_pass columns
math_reading_groupby_df=pd.merge(math_groupby_df,reading_groupby_df, on="school_name" ,how="outer")
math_reading_groupby_df

#Merge math_reading_groupby_df to both_groupby_df
all_groupby_df=pd.merge(math_reading_groupby_df,both_groupby_df, on="school_name", how="outer")
all_groupby_df

#Use this df to merge to summary_v2_df

              school_name  bool_math_pass  bool_reading_pass  bool_both_pass
0      Bailey High School            3318               4077            2719
1     Cabrera High School            1749               1803            1697
2    Figueroa High School            1946               2381            1569
3        Ford High School            1871               2172            1487
4     Griffin High School            1371               1426            1330
5   Hernandez High School            3094               3748            2481
6      Holden High School             395                411             381
7       Huang High School            1916               2372            1561
8     Johnson High School            3145               3867            2549
9        Pena High School             910                923             871
10  Rodriguez High School            2654               3208            2119
11    Shelton High School            1653               1688            1583
12     Thomas High School            1525               1591            1487
13     Wilson High School            2143               2204            2068
14     Wright High School            1680               1739            1626

In [121]:
#SUMMARY - school_df

#Rename coluuns
school_df=school_df.rename(columns={"size":"Total Students","type":"School Type","budget":"Total School Budget"})
school_df

#delete column
school_df=school_df.drop(columns=["School ID"])
school_df

              school_name School Type  Total Students  Total School Budget
0       Huang High School    District            2917              1910635
1    Figueroa High School    District            2949              1884411
2     Shelton High School     Charter            1761              1056600
3   Hernandez High School    District            4635              3022020
4     Griffin High School     Charter            1468               917500
5      Wilson High School     Charter            2283              1319574
6     Cabrera High School     Charter            1858              1081356
7      Bailey High School    District            4976              3124928
8      Holden High School     Charter             427               248087
9        Pena High School     Charter             962               585858
10     Wright High School     Charter            1800              1049400
11  Rodriguez High School    District            3999              2547363
12    Johnson High School    District            4761              3094650
13       Ford High School    District            2739              1763916
14     Thomas High School     Charter            1635              1043130

In [122]:
summary_p1_mean_df

,school_name,Student ID,Average Reading Score,Average Math Score,School ID,size,budget
0,Bailey High School,20358.5,81.033963,77.048432,7.0,4976.0,3124928.0
1,Cabrera High School,16941.5,83.975780,83.061895,6.0,1858.0,1081356.0
2,Figueroa High School,4391.0,81.158020,76.711767,1.0,2949.0,1884411.0
3,Ford High School,36165.0,80.746258,77.102592,13.0,2739.0,1763916.0
4,Griffin High School,12995.5,83.816757,83.351499,4.0,1468.0,917500.0
5,Hernandez High School,9944.0,80.934412,77.289752,3.0,4635.0,3022020.0
6,Holden High School,23060.0,83.814988,83.803279,8.0,427.0,248087.0
7,Huang High School,1458.0,81.182722,76.629414,0.0,2917.0,1910635.0
8,Johnson High School,32415.0,80.966394,77.072464,12.0,4761.0,3094650.0
9,Pena High School,23754.5,84.044699,83.839917,9.0,962.0,585858.0
10,Rodriguez High School,28035.0,80.744686,76.842711,11.0,3999.0,2547363.0
11,Shelton High School,6746.0,83.725724,83.359455,2.0,1761.0,1056600.0
12,Thomas High School,38352.0,83.848930,83.418349,14.0,1635.0,1043130.0
13,Wilson High School,14871.0,83.989488,83.274201,5.0,2283.0,1319574.0
14,Wright High School,25135.5,83.955000,83.682222,10.0,1800.0,1049400.0

In [123]:
###SUMMARY - VERSION 1 , summary_v1_df
summary_v1_df=pd.merge(school_df,summary_p1_mean_df, on="school_name" ,how="outer")
summary_v1_df

#delete columns
summary_v1_df=summary_v1_df.drop(columns=["Student ID", "School ID", "size", "budget"])
summary_v1_df

,school_name,School Type,Total Students,Total School Budget,Average Reading Score,Average Math Score
0,Huang High School,District,2917,1910635,81.182722,76.629414
1,Figueroa High School,District,2949,1884411,81.158020,76.711767
2,Shelton High School,Charter,1761,1056600,83.725724,83.359455
3,Hernandez High School,District,4635,3022020,80.934412,77.289752
4,Griffin High School,Charter,1468,917500,83.816757,83.351499
5,Wilson High School,Charter,2283,1319574,83.989488,83.274201
6,Cabrera High School,Charter,1858,1081356,83.975780,83.061895
7,Bailey High School,District,4976,3124928,81.033963,77.048432
8,Holden High School,Charter,427,248087,83.814988,83.803279
9,Pena High School,Charter,962,585858,84.044699,83.839917
10,Wright High School,Charter,1800,1049400,83.955000,83.682222
11,Rodriguez High School,District,3999,2547363,80.744686,76.842711
12,Johnson High School,District,4761,3094650,80.966394,77.072464
13,Ford High School,District,2739,1763916,80.746258,77.102592
14,Thomas High School,Charter,1635,1043130,83.848930,83.418349

In [124]:
summary_v2_df=pd.merge(summary_v1_df,all_groupby_df, on="school_name",how="outer")
summary_v2_df

,school_name,School Type,Total Students,Total School Budget,Average Reading Score,Average Math Score,bool_math_pass,bool_reading_pass,bool_both_pass
0,Huang High School,District,2917,1910635,81.182722,76.629414,1916,2372,1561
1,Figueroa High School,District,2949,1884411,81.158020,76.711767,1946,2381,1569
2,Shelton High School,Charter,1761,1056600,83.725724,83.359455,1653,1688,1583
3,Hernandez High School,District,4635,3022020,80.934412,77.289752,3094,3748,2481
4,Griffin High School,Charter,1468,917500,83.816757,83.351499,1371,1426,1330
5,Wilson High School,Charter,2283,1319574,83.989488,83.274201,2143,2204,2068
6,Cabrera High School,Charter,1858,1081356,83.975780,83.061895,1749,1803,1697
7,Bailey High School,District,4976,3124928,81.033963,77.048432,3318,4077,2719
8,Holden High School,Charter,427,248087,83.814988,83.803279,395,411,381
9,Pena High School,Charter,962,585858,84.044699,83.839917,910,923,871
10,Wright High School,Charter,1800,1049400,83.955000,83.682222,1680,1739,1626
11,Rodriguez High School,District,3999,2547363,80.744686,76.842711,2654,3208,2119
12,Johnson High School,District,4761,3094650,80.966394,77.072464,3145,3867,2549
13,Ford High School,District,2739,1763916,80.746258,77.102592,1871,2172,1487
14,Thomas High School,Charter,1635,1043130,83.848930,83.418349,1525,1591,1487

In [125]:
#Add % Passing Math column 
summary_v2_df["% Passing Math"]=summary_v2_df["bool_math_pass"]/summary_v2_df["Total Students"]*100

#Add % Passing Reading column
summary_v2_df["% Passing Reading"]=summary_v2_df["bool_reading_pass"]/summary_v2_df["Total Students"]*100

#Add % Passing Both (Math and Reading) column
summary_v2_df["% Overall Passing"]=summary_v2_df["bool_both_pass"]/summary_v2_df["Total Students"]*100

#Drop columns
summary_v2_df=summary_v2_df.drop(columns=["bool_math_pass","bool_reading_pass","bool_both_pass"])

#make school name the index
summary_v2_df=summary_v2_df.set_index("school_name")

#Sort school_name by alphabetical order
summary_v2_df=summary_v2_df.sort_values(by="school_name",ascending=True)
summary_v2_df

#Format the Total School Budget column with $ and ,
summary_v2_df["Total School Budget"]=summary_v2_df["Total School Budget"].map("${:,.2f}".format)
summary_v2_df

,School Type,Total Students,Total School Budget,Average Reading Score,Average Math Score,% Passing Math,% Passing Reading,% Overall Passing
school_name,,,,,,,,
Bailey High School,District,4976,"$3,124,928.00",81.033963,77.048432,66.680064,81.933280,54.642283
Cabrera High School,Charter,1858,"$1,081,356.00",83.975780,83.061895,94.133477,97.039828,91.334769
Figueroa High School,District,2949,"$1,884,411.00",81.158020,76.711767,65.988471,80.739234,53.204476
Ford High School,District,2739,"$1,763,916.00",80.746258,77.102592,68.309602,79.299014,54.289887
Griffin High School,Charter,1468,"$917,500.00",83.816757,83.351499,93.392371,97.138965,90.599455
Hernandez High School,District,4635,"$3,022,020.00",80.934412,77.289752,66.752967,80.862999,53.527508
Holden High School,Charter,427,"$248,087.00",83.814988,83.803279,92.505855,96.252927,89.227166
Huang High School,District,2917,"$1,910,635.00",81.182722,76.629414,65.683922,81.316421,53.513884
Johnson High School,District,4761,"$3,094,650.00",80.966394,77.072464,66.057551,81.222432,53.539172
Pena High School,Charter,962,"$585,858.00",84.044699,83.839917,94.594595,95.945946,90.540541
Rodriguez High School,District,3999,"$2,547,363.00",80.744686,76.842711,66.366592,80.220055,52.988247
Shelton High School,Charter,1761,"$1,056,600.00",83.725724,83.359455,93.867121,95.854628,89.892107
Thomas High School,Charter,1635,"$1,043,130.00",83.848930,83.418349,93.272171,97.308869,90.948012
Wilson High School,Charter,2283,"$1,319,574.00",83.989488,83.274201,93.867718,96.539641,90.582567
Wright High School,Charter,1800,"$1,049,400.00",83.955000,83.682222,93.333333,96.611111,90.333333

In [126]:
#sort and display top 5 performing schools by % Overall Passing

top_overall_schools_df=summary_v2_df.sort_values(by="% Overall Passing", ascending=False)
top_overall_schools_df.head(5)

,School Type,Total Students,Total School Budget,Average Reading Score,Average Math Score,% Passing Math,% Passing Reading,% Overall Passing
school_name,,,,,,,,
Cabrera High School,Charter,1858,"$1,081,356.00",83.975780,83.061895,94.133477,97.039828,91.334769
Thomas High School,Charter,1635,"$1,043,130.00",83.848930,83.418349,93.272171,97.308869,90.948012
Griffin High School,Charter,1468,"$917,500.00",83.816757,83.351499,93.392371,97.138965,90.599455
Wilson High School,Charter,2283,"$1,319,574.00",83.989488,83.274201,93.867718,96.539641,90.582567
Pena High School,Charter,962,"$585,858.00",84.044699,83.839917,94.594595,95.945946,90.540541

In [127]:
#sort and display bottom 5 performing schools by % Overall Passing

bottom_overall_schools_df=summary_v2_df.sort_values(by="% Overall Passing", ascending=True)
bottom_overall_schools_df.head(5)

,School Type,Total Students,Total School Budget,Average Reading Score,Average Math Score,% Passing Math,% Passing Reading,% Overall Passing
school_name,,,,,,,,
Rodriguez High School,District,3999,"$2,547,363.00",80.744686,76.842711,66.366592,80.220055,52.988247
Figueroa High School,District,2949,"$1,884,411.00",81.158020,76.711767,65.988471,80.739234,53.204476
Huang High School,District,2917,"$1,910,635.00",81.182722,76.629414,65.683922,81.316421,53.513884
Hernandez High School,District,4635,"$3,022,020.00",80.934412,77.289752,66.752967,80.862999,53.527508
Johnson High School,District,4761,"$3,094,650.00",80.966394,77.072464,66.057551,81.222432,53.539172

In [128]:
#####MATH SCORES BY GRADE: GROUPBY SCHOOL, output dataframes: g9_groupby_avg_df, g10_groupby_avg_df, g11_groupby_avg_df, g12_groupby_avg_df

##9th Grade##
#Use student_df as the raw data starting point
student_g9_df=student_df.copy()

#Set condition to filter list to only Grade 9
condition=student_g9_df["grade"]=="9th"

student_g9_df=student_g9_df[condition]
student_g9_df

#groupby grade
student_g9_groupby_df=student_g9_df.groupby(["school_name"])
#get average based on group by school_name
g9_groupby_avg_df=student_g9_groupby_df.mean()
g9_groupby_avg_df

#clean up data columns and rename columns
#Drop columns
g9_groupby_avg_df=g9_groupby_avg_df.drop(columns=["Student ID"])
#rename columns
g9_groupby_avg_df=g9_groupby_avg_df.rename(columns={"reading_score":"9th Grade Reading Score","math_score":"9th Grade Math Score"})
print(g9_groupby_avg_df.head(3))


##10th Grade##
#Use student_df as the raw data starting point
student_g10_df=student_df.copy()

#Set condition to filter list to only Grade 10
condition=student_g10_df["grade"]=="10th"

student_g10_df=student_g10_df[condition]
student_g10_df

#groupby grade
student_g10_groupby_df=student_g10_df.groupby(["school_name"])
#get average based on group by school_name
g10_groupby_avg_df=student_g10_groupby_df.mean()
g10_groupby_avg_df

#clean up data columns and rename columns
#Drop columns
g10_groupby_avg_df=g10_groupby_avg_df.drop(columns=["Student ID"])
#rename columns
g10_groupby_avg_df=g10_groupby_avg_df.rename(columns={"reading_score":"10th Grade Reading Score","math_score":"10th Grade Math Score"})
print(g10_groupby_avg_df.head(3))



##11th Grade##
#Use student_df as the raw data starting point
student_g11_df=student_df.copy()

#Set condition to filter list to only Grade 11
condition=student_g11_df["grade"]=="11th"

student_g11_df=student_g11_df[condition]
student_g11_df

#groupby grade
student_g11_groupby_df=student_g11_df.groupby(["school_name"])
#get average based on group by school_name
g11_groupby_avg_df=student_g11_groupby_df.mean()
g11_groupby_avg_df

#clean up data columns and rename columns
#Drop columns
g11_groupby_avg_df=g11_groupby_avg_df.drop(columns=["Student ID"])
#rename columns
g11_groupby_avg_df=g11_groupby_avg_df.rename(columns={"reading_score":"11th Grade Reading Score","math_score":"11th Grade Math Score"})
print(g11_groupby_avg_df.head(3))


##12th Grade##
#Use student_df as the raw data starting point
student_g12_df=student_df.copy()

#Set condition to filter list to only Grade 12
condition=student_g12_df["grade"]=="12th"

student_g12_df=student_g12_df[condition]
student_g12_df

#groupby grade
student_g12_groupby_df=student_g12_df.groupby(["school_name"])
#get average based on group by school_name
g12_groupby_avg_df=student_g12_groupby_df.mean()
g12_groupby_avg_df

#clean up data columns and rename columns
#Drop columns
g12_groupby_avg_df=g12_groupby_avg_df.drop(columns=["Student ID"])
#rename columns
g12_groupby_avg_df=g12_groupby_avg_df.rename(columns={"reading_score":"12th Grade Reading Score","math_score":"12th Grade Math Score"})
print(g12_groupby_avg_df.head(3))

                      9th Grade Reading Score  9th Grade Math Score
school_name
Bailey High School                  81.303155             77.083676
Cabrera High School                 83.676136             83.094697
Figueroa High School                81.198598             76.403037
                      10th Grade Reading Score  10th Grade Math Score
school_name
Bailey High School                   80.907183              76.996772
Cabrera High School                  84.253219              83.154506
Figueroa High School                 81.408912              76.539974
                      11th Grade Reading Score  11th Grade Math Score
school_name
Bailey High School                   80.945643              77.515588
Cabrera High School                  83.788382              82.765560
Figueroa High School                 80.640339              76.884344
                      12th Grade Reading Score  12th Grade Math Score
school_name
Bailey High School                   80.912451              76.492218
Cabrera High School                  84.287958              83.277487
Figueroa High School                 81.384863              77.151369

In [129]:
#MATH AND READING SCORES BY GRADE: MERGING DATAFRAMES, on school_name: g9_groupby_avg_df, g10_groupby_avg_df, g11_groupby_avg_df, g12_groupby_avg_df

g9_10_avg_df=pd.merge(g9_groupby_avg_df,g10_groupby_avg_df,on="school_name")
g9_10_11_avg_df=pd.merge(g9_10_avg_df,g11_groupby_avg_df,on="school_name")
g9_10_11_12_avg_df=pd.merge(g9_10_11_avg_df,g12_groupby_avg_df,on="school_name")
##TEST print all averages of Math and Reading for all grades, grouped by school name
print(g9_10_11_12_avg_df.head(3))

                      9th Grade Reading Score  9th Grade Math Score  \
school_name
Bailey High School                  81.303155             77.083676
Cabrera High School                 83.676136             83.094697
Figueroa High School                81.198598             76.403037

                      10th Grade Reading Score  10th Grade Math Score  \
school_name
Bailey High School                   80.907183              76.996772
Cabrera High School                  84.253219              83.154506
Figueroa High School                 81.408912              76.539974

                      11th Grade Reading Score  11th Grade Math Score  \
school_name
Bailey High School                   80.945643              77.515588
Cabrera High School                  83.788382              82.765560
Figueroa High School                 80.640339              76.884344

                      12th Grade Reading Score  12th Grade Math Score
school_name
Bailey High School                   80.912451              76.492218
Cabrera High School                  84.287958              83.277487
Figueroa High School                 81.384863              77.151369

In [130]:
###MATH SCORE BY GRADE### This is the final table

#copy math and reading avg score df
math_avg_score_grouped_df=g9_10_11_12_avg_df.copy()

#Drop Columns
math_avg_score_grouped_df=math_avg_score_grouped_df.drop(columns=["9th Grade Reading Score","10th Grade Reading Score","11th Grade Reading Score","12th Grade Reading Score"])
math_avg_score_grouped_df

#Rename Columns as per solutions
math_avg_score_grouped_df=math_avg_score_grouped_df.rename(columns={"9th Grade Math Score":"9th","10th Grade Math Score":"10th","11th Grade Math Score":"11th","12th Grade Math Score":"12th"})

print(f"MATH SCORES BY GRADE \n {math_avg_score_grouped_df}")

MATH SCORES BY GRADE
                              9th       10th       11th       12th
school_name
Bailey High School     77.083676  76.996772  77.515588  76.492218
Cabrera High School    83.094697  83.154506  82.765560  83.277487
Figueroa High School   76.403037  76.539974  76.884344  77.151369
Ford High School       77.361345  77.672316  76.918058  76.179963
Griffin High School    82.044010  84.229064  83.842105  83.356164
Hernandez High School  77.438495  77.337408  77.136029  77.186567
Holden High School     83.787402  83.429825  85.000000  82.855422
Huang High School      77.027251  75.908735  76.446602  77.225641
Johnson High School    77.187857  76.691117  77.491653  76.863248
Pena High School       83.625455  83.372000  84.328125  84.121547
Rodriguez High School  76.859966  76.612500  76.395626  77.690748
Shelton High School    83.420755  82.917411  83.383495  83.778976
Thomas High School     83.590022  83.087886  83.498795  83.497041
Wilson High School     83.085578  83.724422  83.195326  83.035794
Wright High School     83.264706  84.010288  83.836782  83.644986

In [131]:
##READING SCORE BY GRADE### This is the final table

#copy reading and reading avg score df
reading_avg_score_grouped_df=g9_10_11_12_avg_df.copy()

#Drop Columns
reading_avg_score_grouped_df=reading_avg_score_grouped_df.drop(columns=["9th Grade Math Score","10th Grade Math Score","11th Grade Math Score","12th Grade Math Score"])
reading_avg_score_grouped_df

#Rename Columns as per solutions
reading_avg_score_grouped_df=reading_avg_score_grouped_df.rename(columns={"9th Grade Reading Score":"9th","10th Grade Reading Score":"10th","11th Grade Reading Score":"11th","12th Grade Reading Score":"12th"})

print(f"READING SCORES BY GRADE \n {reading_avg_score_grouped_df}")

READING SCORES BY GRADE
                              9th       10th       11th       12th
school_name
Bailey High School     81.303155  80.907183  80.945643  80.912451
Cabrera High School    83.676136  84.253219  83.788382  84.287958
Figueroa High School   81.198598  81.408912  80.640339  81.384863
Ford High School       80.632653  81.262712  80.403642  80.662338
Griffin High School    83.369193  83.706897  84.288089  84.013699
Hernandez High School  80.866860  80.660147  81.396140  80.857143
Holden High School     83.677165  83.324561  83.815534  84.698795
Huang High School      81.290284  81.512386  81.417476  80.305983
Johnson High School    81.260714  80.773431  80.616027  81.227564
Pena High School       83.807273  83.612000  84.335938  84.591160
Rodriguez High School  80.993127  80.629808  80.864811  80.376426
Shelton High School    84.122642  83.441964  84.373786  82.781671
Thomas High School     83.728850  84.254157  83.585542  83.831361
Wilson High School     83.939778  84.021452  83.764608  84.317673
Wright High School     83.833333  83.812757  84.156322  84.073171

In [132]:
bool_reading_pass_df

              school_name  bool_reading_pass
1       Huang High School               True
2       Huang High School               True
4       Huang High School               True
5       Huang High School               True
6       Huang High School               True
...                   ...                ...
39165  Thomas High School               True
39166  Thomas High School               True
39167  Thomas High School               True
39168  Thomas High School               True
39169  Thomas High School               True

[33610 rows x 2 columns]

In [133]:
#Scores by School Spending
#Use previous dataframes created which lists all students, all trues for pass on the subjects: bool_math_pass_df, bool_reading_pass_df, bool_both_pass_df

# print(complete_df.head(3))
print(bool_math_df.head(3))
# print(bool_reading_df.head(3))
# print(bool_both_df.head(3))

avg_complete_df=complete_df.copy()

#add columns which are different - add bool_mass_pass column
cols=bool_math_df.columns.difference(avg_complete_df.columns)

avg_complete_df=avg_complete_df.join(bool_math_df[cols])
avg_complete_df

#add columns which are different - add bool_reading_pass column
cols1=bool_reading_df.columns.difference(avg_complete_df.columns)

avg_complete_df=avg_complete_df.join(bool_reading_df[cols1])
avg_complete_df

#add columns which are different - add bool_both_pass column
cols2=bool_both_df.columns.difference(avg_complete_df.columns)

avg_complete_df=avg_complete_df.join(bool_both_df[cols2])
avg_complete_df


avg_complete_df["budget per student"]=avg_complete_df["budget"]/avg_complete_df["size"]

# #Add % Passing Math column 
# avg_complete_df=pd.merge(avg_complete_df,bool_math_pass_df,on="index")
# avg_complete_df

#Binning Spending Ranges per Student
bins=[0,584,629,644,675]
group_names=["<$584","$585-629","$630-644","$645-675"]

avg_complete_df["Spending Range Group"]=pd.cut(avg_complete_df["budget per student"], bins, labels=group_names, include_lowest=True)

#Groupby the Spending Range Group
avg_complete_df=avg_complete_df.groupby(["Spending Range Group"])
avg_complete_df=avg_complete_df.mean()
avg_complete_df

   Student ID     student_name gender grade        school_name  reading_score  \
0           0     Paul Bradley      M   9th  Huang High School             66
1           1     Victor Smith      M  12th  Huang High School             94
2           2  Kevin Rodriguez      M  12th  Huang High School             90

   math_score  School ID      type  size   budget  bool_math_pass
0          79          0  District  2917  1910635            True
1          61          0  District  2917  1910635           False
2          60          0  District  2917  1910635           False

,Student ID,reading_score,math_score,School ID,size,budget,bool_math_pass,bool_reading_pass,bool_both_pass,budget per student
Spending Range Group,,,,,,,,,,
<$584,18925.615578,83.964039,83.363065,6.906250,1898.018530,1.101853e+06,0.937029,0.966866,0.906407,580.781564
$585-629,16920.783790,82.312643,79.982873,5.768954,3375.386168,2.107647e+06,0.791099,0.885131,0.709392,620.146831
$630-644,25333.198993,81.301007,77.821056,9.312401,3079.310016,1.967931e+06,0.706236,0.826002,0.588412,639.358771
$645-675,16622.369934,81.005604,77.049297,5.769268,4276.718509,2.786812e+06,0.662308,0.811094,0.535288,651.937383

In [134]:
#AVERAGE SPENDING RANGES PER STUDENT